#ifndef __TOUCH_H__
#define __TOUCH_H__
#include "stm32f4xx_conf.h" 

#define TCS_LOW    	GPIO_ResetBits(GPIOD, GPIO_Pin_12)
#define TCS_HIGH   	GPIO_SetBits(GPIOD, GPIO_Pin_12)     
#define PEN_State		(GPIOD->IDR&GPIO_Pin_13)

#define SAMP_CNT 4                              //采用次数
#define SAMP_CNT_DIV2 2                         //采用取值个数
#define ADJUST_DE           30                 //校验的阀门值，越小越精准但越难校验成功
#define CMD_RDY 0X90  
#define CMD_RDX	0XD0    											 	    
			  
/******************************************************************************************
*函数名：Touch_Init()
* 参数：void
* 返回值：void
* 功能：触摸芯片初始化
*********************************************************************************************/
void Touch_Init(void);
/******************************************************************************************
*函数名：DrawTouchPoint()
* 参数：uint16_t x,uint16_t y xy坐标
* 返回值：void
* 功能：绘制触摸笔笔尖的点
*********************************************************************************************/
void DrawTouchPoint(uint16_t x,uint16_t y);
/******************************************************************************************
*函数名：DrawAdjustPoint()
* 参数：uint16_t x,uint16_t y xy坐标
* 返回值：void
* 功能：绘制触摸校准时使用的准星
*********************************************************************************************/
void DrawAdjustPoint(uint16_t x,uint16_t y);
/******************************************************************************************
*函数名：AdjustTouchPanel()
* 参数：void
* 返回值：void
* 功能：触摸屏校准函数
*********************************************************************************************/
void AdjustTouchPanel(void);
/******************************************************************************************
*函数名：ADS_Read()
* 参数：uint8_t CMD 指令，读x或读y
* 返回值：void
* 功能：读取ADS的ADC值
*********************************************************************************************/
uint16_t ADS_Read(uint8_t CMD);
/******************************************************************************************
*函数名：ADS_ReadWrite()
* 参数：uint8_t byte 发送的8位数据
* 返回值：uint8_t 8位数据
* 功能：SPI读写函数
*********************************************************************************************/
static uint8_t ADS_ReadWrite(uint8_t byte);
/******************************************************************************************
*函数名：Touch_GetPhyXY()
* 参数：void
* 返回值：uint8_t 返回1表示成功，返回0表示失败
* 功能：读取XY物理位置
*********************************************************************************************/
uint8_t Touch_GetPhyXY(void);

#endif


